Futbol_coach/app/controllers/clubs_controller.rb

  def index
    @clubs = Club.all
---
SELECT "clubs".* FROM "clubs"

  def show
    @club = Club.find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def create
    #if this work lets save
    @club = Club.new(club_params)
    if @club.valid?
      @club.save
---
INSERT INTO "clubs" ("name", "city", "home_arena", "wins", "losses", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "nigeria"], ["city", "nigeria"], ["home_arena", "grand nigeria"], ["wins", 4], ["losses", 4], ["created_at", "2020-11-03 20:34:17.808626"], ["updated_at", "2020-11-03 20:34:17.808626"]]

  def edit
    @club = Club.find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]

  def update
     @club = Club.find(params[:id])
     if @club.update(club_params)
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "clubs" SET "wins" = ?, "updated_at" = ? WHERE "clubs"."id" = ?  [["wins", 5], ["updated_at", "2020-11-04 19:49:16.538408"], ["id", 18]]

  def destroy
    @club = Club.find(params[:id])
    @club.delete
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
DELETE FROM "clubs" WHERE "clubs"."id" = ?  [["id", 23]]