Futbol_coach/app/controllers/players_controller.rb

  def create
    @player = Player.new(player_params)
    if @player.valid?
      @player.save
---
INSERT INTO "players" ("name", "phone_number", "email", "player_number", "created_at", "updated_at", "club_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    find_player
    @player.update(player_params)
---
UPDATE "players" SET "phone_number" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["phone_number", 987987], ["updated_at", "2020-11-04 21:11:30.805160"], ["id", 80]]

  def destroy
    find_player.delete
---
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 105]]

  def find_player
    @player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 103], ["LIMIT", 1]]