Futbol_coach/app/views/players/_player_form.html.erb

SELECT "clubs".* FROM "clubs"
---
        <%= f.label :club_id, "Team" %>
        <%= f.collection_select :club_id, Club.all, :id, :name %>